andrewleech/micropython/ports/stm32/powerctrl.c
        // If reducing SYSCLK below CPU2's minimum operating frequency,
        // verify CPU2 is in deep sleep or standby first. No C2HPRE
        // prescaler value can compensate — at 4MHz SYSCLK the best
        // achievable HCLK2 is 4MHz, but CPU2 needs >= 32MHz when awake.
        if (sysclk < CPU2_MIN_SYSCLK && sysclk < sysclk_cur) {
            if (!LL_PWR_IsActiveFlag_C2DS() && !LL_PWR_IsActiveFlag_C2SB()) {
                LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
                return -MP_EPERM;
            }
        }
    }
    #endif

    // Exit LPR if SYSCLK will increase beyond threshold.
    if (LL_PWR_IsEnabledLowPowerRunMode()) {
        if (sysclk > LPR_THRESHOLD) {
            if (sysclk_cur < LPR_THRESHOLD) {
                // Must select MSI=LPR_THRESHOLD=2MHz to exit LPR.
                LL_RCC_MSI_SetRange(LL_RCC_MSIRANGE_5);
            }

            // Exit LPR and wait for the regulator to be ready.
            LL_PWR_ExitLowPowerRunMode();
            if (!powerctrl_wait_flag(&PWR->SR2, PWR_SR2_REGLPF, PWR_SR2_REGLPF, POWERCTRL_TIMEOUT_MS)) {
                #if defined(STM32WB)
                if (hsem_held) {
                    LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
                }
                #endif
                return -MP_ETIMEDOUT;
            }
        }
    }

    // Select VOS1 if SYSCLK will increase beyond threshold.
    if (sysclk > VOS2_THRESHOLD) {
        LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
        if (!powerctrl_wait_flag(&PWR->SR2, PWR_SR2_VOSF, 0, POWERCTRL_TIMEOUT_MS)) {
            #if defined(STM32WB)
            if (hsem_held) {
                LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
            }
            #endif
            return -MP_ETIMEDOUT;
        }
    }

    if (sysclk_mode == SYSCLK_MODE_HSE_64M) {
        // SystemClock_Config() acquires its own HSEM lock internally.
        // Release ours first to avoid double-acquire deadlock.
        #if defined(STM32WB)
        if (hsem_held) {
            LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
            hsem_held = false;
        }
        #endif
        SystemClock_Config();
    } else if (sysclk_mode == SYSCLK_MODE_MSI) {
        // Set flash latency to maximum to ensure the latency is large enough for
        // both the current SYSCLK and the SYSCLK that will be selected below.
        LL_FLASH_SetLatency(FLASH_LATENCY_MAX);
        if (!powerctrl_wait_flag(&FLASH->ACR, FLASH_ACR_LATENCY_Msk,
                FLASH_LATENCY_MAX, POWERCTRL_TIMEOUT_MS)) {
            goto timeout_release;
        }

        // Before changing the MSIRANGE value, if MSI is on then it must also be ready.
        if (!powerctrl_wait_flag(&RCC->CR, RCC_CR_MSIRDY | RCC_CR_MSION,
                RCC_CR_MSIRDY | RCC_CR_MSION, POWERCTRL_TIMEOUT_MS)) {
            goto timeout_release;
        }
        LL_RCC_MSI_SetRange(msirange << RCC_CR_MSIRANGE_Pos);

        // Clock SYSCLK from MSI.
        LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_MSI);
        if (!powerctrl_wait_flag(&RCC->CFGR, RCC_CFGR_SWS_Msk,
                LL_RCC_SYS_CLKSOURCE_STATUS_MSI, POWERCTRL_TIMEOUT_MS)) {
            goto timeout_release;
        }

        // Disable PLL to decrease power consumption.
        LL_RCC_PLL_Disable();
        if (!powerctrl_wait_flag(&RCC->CR, RCC_CR_PLLRDY, 0, POWERCTRL_TIMEOUT_MS)) {
            goto timeout_release;
        }
        LL_RCC_PLL_DisableDomain_SYS();

        // Select VOS2 if possible.
        if (sysclk <= VOS2_THRESHOLD) {
            LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE2);
        }

        // Enter LPR if possible.
        if (sysclk <= LPR_THRESHOLD) {
            LL_PWR_EnterLowPowerRunMode();
        }

        // Configure flash latency for the new SYSCLK.
        LL_SetFlashLatency(sysclk);

        // Update HAL state and SysTick.
        SystemCoreClockUpdate();
        powerctrl_config_systick();
    }

    #if defined(STM32WB)
    if (hsem_held) {
        LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
        hsem_held = false;
    }
    #endif

    // Return straight away if the clocks are already at the desired frequency.
    if (ahb == HAL_RCC_GetHCLKFreq()
        && apb1 == HAL_RCC_GetPCLK1Freq()
        && apb2 == HAL_RCC_GetPCLK2Freq()) {
        return 0;
    }

    // Calculate and configure the bus clock dividers.
    uint32_t cfgr = RCC->CFGR;
    cfgr &= ~(7 << RCC_CFGR_PPRE2_Pos | 7 << RCC_CFGR_PPRE1_Pos | 0xf << RCC_CFGR_HPRE_Pos);
    cfgr |= calc_ahb_div(sysclk / ahb);
    cfgr |= calc_apb1_div(ahb / apb1);
    cfgr |= calc_apb2_div(ahb / apb2) << (RCC_CFGR_PPRE2_Pos - RCC_CFGR_PPRE1_Pos);
    RCC->CFGR = cfgr;

    return 0;

    #if defined(STM32WB)
timeout_release:
    if (hsem_held) {
        LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
    }
    return -MP_ETIMEDOUT;
    #endif
}

#if defined(STM32WB)

static void powerctrl_switch_on_HSI(void) {
    LL_RCC_HSI_Enable();
    while (!LL_RCC_HSI_IsReady()) {
    }
    LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSI);
    LL_RCC_SetSMPSClockSource(LL_RCC_SMPS_CLKSOURCE_HSI);
    while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSI) {
    }
    return;
}

static void powerctrl_low_power_prep_wb55() {
    // See WB55 specific documentation in AN5289 Rev 6, and in particular, Figure 6.
    while (LL_HSEM_1StepLock(HSEM, CFG_HW_RCC_SEMID)) {
    }
    if (!LL_HSEM_1StepLock(HSEM, CFG_HW_ENTRY_STOP_MODE_SEMID)) {
        if (LL_PWR_IsActiveFlag_C2DS() || LL_PWR_IsActiveFlag_C2SB()) {
            // Release ENTRY_STOP_MODE semaphore
            LL_HSEM_ReleaseLock(HSEM, CFG_HW_ENTRY_STOP_MODE_SEMID, 0);

            powerctrl_switch_on_HSI();
        }
    } else {
        powerctrl_switch_on_HSI();
    }
    // Release RCC semaphore
    LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, 0);
}

static void powerctrl_low_power_exit_wb55() {
    // Ensure the HSE/HSI clock configuration is correct so core2 can wake properly again.
    // See WB55 specific documentation in AN5289 Rev 6, and in particular, Figure 7.
    LL_HSEM_ReleaseLock(HSEM, CFG_HW_ENTRY_STOP_MODE_SEMID, 0);
    // Acquire RCC semaphore before adjusting clocks.
    while (LL_HSEM_1StepLock(HSEM, CFG_HW_RCC_SEMID)) {
    }

